Repository: python-guide-es/python-guide
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: es

source: An opinionated guide to the Python programming language and a best practice handbook for the installation, configuration, and usage of Python on a daily basis.
es: Una guía obstinada del lenguaje de programación Python y un manual de mejores prácticas para la instalación, configuración y uso de Python a diario.

source: The Hitchhiker's Guide to Python!
es: La Guía de Hitchhiker para Python!

source: Greetings, Earthling! Welcome to The Hitchhiker's Guide to Python.
es: Saludos, Terricola! Bienvenidos a la guía de Hitchhiker para Python.

source: **This is a living, breathing guide.** If you'd like to contribute, `fork us on GitHub <https://github.com/realpython/python-guide>`_!
es: **Esta es una guía viva y activa.** Si deseas contribuir, `crea una copia en GitHub <https://github.com/realpython/python-guide>`_!

source: This handcrafted guide exists to provide both novice and expert Python developers a best practice handbook for the installation, configuration, and usage of Python on a daily basis.
es: Esta guía hecha a mano existe para proporcionar a los desarrolladores de Python, tanto novatos como expertos, un manual de mejores prácticas para la instalación, configuración y uso de Python a diario.

source: This guide is **opinionated** in a way that is almost, but not quite, entirely *unlike* Python's official documentation. You won't find a list of every Python web framework available here. Rather, you'll find a nice concise list of highly recommended options.
es: Esta guía es **obstinada** en la manera que casi todo, pero no del todo, es *diferente* a la documentación oficial de Python. No encontrará una lista de cada framework web disponible aquí. Más bien, encontrará una lista concisa de opciones altamente recomendadas.

source: The use of **Python 3** is *highly* recommended over Python 2. Consider upgrading your applications and infrastructures if you find yourself *still* using Python 2 in production today. If you are using Python 3, congratulations — you are indeed a person of excellent taste. —*Kenneth Reitz*
es: El uso de **Python 3** es *altamente* recomendado sobre Python 2. Considera actualizar tus aplicaciones e infraestructura si te encuentras *aún* usando Python 2 en producción. Si estas usando Python 3, felicitaciones — eres de hecho una persona de excelente gusto. —*Kenneth Reitz*

source: Let's get started! But first, let's make sure you know where your towel is.
es: !Empezemos! Pero primero, vamos a asegurarnos que sabes dónde estás.

source: Getting Started with Python
es: Primeros Pasos con Python

source: New to Python? Let's properly setup up your Python environment:
es: ¿Nuevo en Python? Configuremos apropiadamente tu ambiente de Python:

source: Properly Install Python on your system:
es: Instala correctamente Python en tu sistema:

source: Using Virtualenvs with Pipenv:
es: Usando Virtualenvs con Pipenv:

source: Python Development Environments
es: Entornos de Desarrollo Python

source: This part of the guide focuses on the Python development environment, and the best-practice tools that are available for writing Python code.
es: Esta parte de la guía se enfoca en el ambiente de desarrollo Python y las mejores prácticas que están disponibles para escribir código Python.

source: Writing Great Python Code
es: Escribiendo Buen Código Python

source: This part of the guide focuses on the best-practices for writing Python code.
es: Esta parte de la guía se enfoca en las mejores prácticas para la escritura de código Python.

source: Scenario Guide for Python Applications
es: Escenarios Guía para Aplicaciones Python

source: This part of the guide focuses on tool and module advice based on different scenarios.
es: Esta parte de la guía se enfoca en recomendación de herramientas y módulos de acuerdo a diferentes escenarios.

source: Shipping Great Python Code
es: Entregar Buen Código Python

source: This part of the guide focuses on sharing and deploying your Python code.
es: Esta parte de la guía se enfoca en compartir y desplegar tú código Python.

source: Additional Notes
es: Notas Adicionales

source: This part of the guide, which is mostly prose, begins with some background information about Python, and then focuses on next steps.
es: Esta parte de la guía, que está principalmente en prosa, comienza con información básica sobre Python y luego se centra en los siguientes pasos.

source: Notes defined within all diatonic and chromatic musical scales have been intentionally excluded from this list of additional notes. Additionally, this note.
es: Las notas definidas dentro de todas las escalas musicales diatónicas y cromáticas se han excluido intencionalmente de esta lista de notas adicionales. Incluyendo, esta nota.

source: Contribution notes and legal information (for those interested).
es: Notas de contribución e información legal (para los insteresados).
